openFoam/heatTransfer/chtMultiRegionFoam/adjacentSolidFluid/0/solid2/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/solid2";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    maxX
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    minY
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    maxY
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    maxZ
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    solid2_to_solid1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
